OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0/examples/iot/coap/ipv6/client_observe/main.c
    // The list of IoT Timer clients is declared as a constant.
    static const iot_timer_clients_list_t iot_timer_clients =
    {
        (sizeof(list_of_clients) / sizeof(iot_timer_client_t)),
        &(list_of_clients[0]),
    };

    // Passing the list of clients to the IoT Timer module.
    err_code = iot_timer_client_list_set(&iot_timer_clients);
    APP_ERROR_CHECK(err_code);

    // Starting the app timer instance that is the tick source for the IoT Timer.
    err_code = app_timer_start(m_iot_timer_tick_src_id,
                               APP_TIMER_TICKS(IOT_TIMER_RESOLUTION_IN_MS),
                               NULL);
    APP_ERROR_CHECK(err_code);
}


static void coap_response_handler(uint32_t status, void * arg, coap_message_t * p_response)
{
    if (status == NRF_SUCCESS)
    {
        if (coap_message_opt_present(p_response, COAP_OPT_OBSERVE) == NRF_SUCCESS)
        {
            // It is an notification or result of a GET response
            LEDS_ON(LED_FOUR);
        }
        else
        {
            LEDS_OFF(LED_FOUR);
        }


        APPL_LOG("Response Code : %d", p_response->header.code);
        if (p_response->header.code == COAP_CODE_205_CONTENT)
        {
            switch (p_response->p_payload[0])
            {
                case STATUS_ON:
                    LEDS_ON(LED_THREE);
                    break;

                case STATUS_OFF:
                    LEDS_OFF(LED_THREE);
                    break;

                default:
                    break;
            }
        }
    }

    // Upon CON response. Reply with ACK.
    if (p_response->header.type == COAP_TYPE_CON)
    {
        coap_message_conf_t ack_config;
        memset(&ack_config, 0x00, sizeof(coap_message_conf_t));

        ack_config.type = COAP_TYPE_ACK;
        ack_config.code = COAP_CODE_EMPTY_MESSAGE;

        // PIGGY BACKED RESPONSE
        ack_config.code = COAP_CODE_205_CONTENT;
        // Copy message ID.
        ack_config.id   = p_response->header.id;
        // Set local port number to use.
        ack_config.port.port_number = LOCAL_PORT_NUM;
        // Copy token.
        memcpy(&ack_config.token[0], &p_response->token[0], p_response->header.token_len);
        // Copy token length.
        ack_config.token_len = p_response->header.token_len;

        coap_message_t * p_ack;
        uint32_t err_code = coap_message_new(&p_ack, &ack_config);
        APP_ERROR_CHECK(err_code);

        err_code = coap_message_remote_addr_set(p_ack, &p_response->remote);
        APP_ERROR_CHECK(err_code);

        uint32_t msg_handle;
        err_code = coap_message_send(&msg_handle, p_ack);
        APP_ERROR_CHECK(err_code);

        err_code = coap_message_delete(p_ack);
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling button events.
 *
 * @param[in]   pin_no         The pin number of the button pressed.
 * @param[in]   button_action  The action performed on button.
 */
static void button_event_handler(uint8_t pin_no, uint8_t button_action)
{
#ifdef COMMISSIONING_ENABLED
    if ((button_action == APP_BUTTON_PUSH) && (pin_no == ERASE_BUTTON_PIN_NO))
    {
        APPL_LOG("Erasing all commissioning settings from persistent storage...");
        commissioning_settings_clear();
        return;
    }
#endif // COMMISSIONING_ENABLED

    if (mp_interface == NULL)
    {
        return;
    }

    uint32_t err_code;
    if (button_action == APP_BUTTON_PUSH)
    {
        coap_message_t      * p_request = NULL;

        switch (pin_no)
        {
            case BUTTON_ONE:
            {
                coap_message_conf_t   message_conf;
                memset(&message_conf, 0x00, sizeof(message_conf));
                coap_remote_t         remote_device;

                message_conf.type             = COAP_MESSAGE_TYPE;
                message_conf.code             = COAP_CODE_GET;
                message_conf.port.port_number = LOCAL_PORT_NUM;
                message_conf.id               = 0;

                // Set token.
                m_led3_observe_token = m_global_token_count;
                (void)uint16_encode(HTONS(m_global_token_count), message_conf.token);
                m_global_token_count++;

                message_conf.token_len = 2;
                message_conf.response_callback = coap_response_handler;

                err_code = coap_message_new(&p_request, &message_conf);
                APP_ERROR_CHECK(err_code);

                memcpy(&remote_device.addr[0], (uint8_t []){SERVER_IPV6_ADDRESS}, IPV6_ADDR_SIZE);
                remote_device.port_number = REMOTE_PORT_NUM;
                err_code = coap_message_remote_addr_set(p_request, &remote_device);
                APP_ERROR_CHECK(err_code);

                // Subscribe to the resource.
                err_code = coap_message_opt_uint_add(p_request, COAP_OPT_OBSERVE, 0);
                APP_ERROR_CHECK(err_code);

                err_code = coap_message_opt_str_add(p_request, COAP_OPT_URI_PATH, (uint8_t *)m_uri_part_lights, strlen(m_uri_part_lights));
                APP_ERROR_CHECK(err_code);

                err_code = coap_message_opt_str_add(p_request, COAP_OPT_URI_PATH, (uint8_t *)m_uri_part_led3, strlen(m_uri_part_led3));
                APP_ERROR_CHECK(err_code);

                err_code = coap_message_opt_uint_add(p_request, COAP_OPT_ACCEPT, 0);
                APP_ERROR_CHECK(err_code);

                break;
            }
            case BUTTON_TWO:
            {
                coap_message_conf_t   message_conf;
                memset(&message_conf, 0x00, sizeof(message_conf));
                coap_remote_t         remote_device;

                message_conf.type             = COAP_MESSAGE_TYPE;
                message_conf.code             = COAP_CODE_GET;
                message_conf.port.port_number = LOCAL_PORT_NUM;
                message_conf.id               = 0;

                // Re-use the original token for the observe.
                (void)uint16_encode(HTONS(m_led3_observe_token), message_conf.token);

